In [103]:
import pandas as pd

In [104]:
a = {
    "name":['a','b','c'],
    "language":['python','ds','cpp'],
    "marks":[30,40,50]
}

In [105]:
df = pd.DataFrame(a)
df.ndim

2

In [106]:
df

  name language  marks
0    a   python     30
1    b       ds     40
2    c      cpp     50

In [107]:
type(df.name)

pandas.core.series.Series

In [108]:
df = pd.read_csv('data.csv')

In [109]:
df

  name    language  marks
0    a      python     30
1    b           c     40
2    c         cpp     50
3    d        java     60
4    e     android     70
5    f     flutter     80
6    g        ruby     90
7    h  javascript     40
8    i  typescript     70
9    j      python     78

In [110]:
a=['a','b','c']
b=[45,67,24]
z=dict(zip(a,b))

In [111]:
z

{'a': 45, 'b': 67, 'c': 24}

In [112]:
df1 = pd.DataFrame(z,index=[0,1,2,3,4])
df1

    a   b   c
0  45  67  24
1  45  67  24
2  45  67  24
3  45  67  24
4  45  67  24

In [113]:
s1 = pd.Series(a)
s1

0    a
1    b
2    c
dtype: object

In [114]:
s2 = pd.Series(b)
s2

0    45
1    67
2    24
dtype: int64

In [115]:
df[df.marks>40]

  name    language  marks
2    c         cpp     50
3    d        java     60
4    e     android     70
5    f     flutter     80
6    g        ruby     90
8    i  typescript     70
9    j      python     78

In [116]:
newdf = df[df.marks==50]
newdf

  name language  marks
2    c      cpp     50

In [117]:
newdf = df[(df.marks>50) & (df.language=='python')]
newdf

  name language  marks
9    j   python     78

In [118]:
df[['name','marks']]

  name  marks
0    a     30
1    b     40
2    c     50
3    d     60
4    e     70
5    f     80
6    g     90
7    h     40
8    i     70
9    j     78

In [119]:
df[0:2]

  name language  marks
0    a   python     30
1    b        c     40

In [120]:
df[-1:]

  name language  marks
9    j   python     78

In [121]:
df.loc[[0,2],:]

  name language  marks
0    a   python     30
2    c      cpp     50

In [122]:
df.loc[0,:]

name             a
language    python
marks           30
Name: 0, dtype: object

In [123]:
df.loc[0:2,:]

  name language  marks
0    a   python     30
1    b        c     40
2    c      cpp     50

In [124]:
df.loc[0:1,:]

  name language  marks
0    a   python     30
1    b        c     40

In [125]:
df['merge'] = df['name'] + df['language']
df

  name    language  marks        merge
0    a      python     30      apython
1    b           c     40           bc
2    c         cpp     50         ccpp
3    d        java     60        djava
4    e     android     70     eandroid
5    f     flutter     80     fflutter
6    g        ruby     90        gruby
7    h  javascript     40  hjavascript
8    i  typescript     70  itypescript
9    j      python     78      jpython